{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "17"}]}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Relu", "op": "_FusedMatMul", "input": ["inputs", "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Cast/ReadVariableOp", "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Relu", "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Cast/ReadVariableOp", "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Relu", "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Cast/ReadVariableOp", "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Relu", "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Cast/ReadVariableOp", "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Relu", "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Cast/ReadVariableOp", "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Cast/ReadVariableOp", "shape": [17, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_142_1/Add/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Cast/ReadVariableOp", "shape": [16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_143_1/Add/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Cast/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_144_1/Add/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Cast/ReadVariableOp", "shape": [64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_145_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Cast/ReadVariableOp", "shape": [128, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_neural_network_model_1/dense_146_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}